# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2023-11-06 19:33:06 krylon>
#
#+TAGS: go(g) internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Vox
  Vox is an audio book reader that saves your listening progress.
* Clocktable
  #+BEGIN: clocktable :scope file :maxlevel 202 :emphasize t
  #+CAPTION: Clock summary at [2023-11-06 Mo 19:33]
  | Headline             | Time    |         |      |
  |----------------------+---------+---------+------|
  | *Total time*         | *15:35* |         |      |
  |----------------------+---------+---------+------|
  | *Components [0/0]*   | *15:35* |         |      |
  | \_  /Database [0/1]/ |         | /14:32/ |      |
  | \_    Data types     |         |         | 2:35 |
  | \_  /Scanner [0/0]/  |         | /1:03/  |      |
  #+END:
* Components [0/0]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
** Database [0/1]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
   :LOGBOOK:
   CLOCK: [2023-11-04 Sa 18:05]--[2023-11-04 Sa 20:50] =>  2:45
   CLOCK: [2023-11-03 Fr 17:46]--[2023-11-03 Fr 20:31] =>  2:45
   CLOCK: [2023-11-02 Do 20:17]--[2023-11-02 Do 21:37] =>  1:20
   CLOCK: [2023-10-29 So 16:35]--[2023-10-29 So 18:55] =>  2:20
   CLOCK: [2023-10-28 Sa 21:15]--[2023-10-28 Sa 23:44] =>  2:29
   CLOCK: [2023-10-28 Sa 15:47]--[2023-10-28 Sa 16:05] =>  0:18
   :END:
*** TODO Data types
    :LOGBOOK:
    CLOCK: [2023-10-31 Di 19:24]--[2023-10-31 Di 20:31] =>  1:07
    CLOCK: [2023-10-26 Do 22:45]--[2023-10-27 Fr 00:01] =>  1:16
    CLOCK: [2023-10-26 Do 17:55]--[2023-10-26 Do 18:07] =>  0:12
    :END:
    I copied the database schema over from my last attempt in Go, now I need
    to change my data types accordingly. :-|
** Scanner [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
   :LOGBOOK:
   CLOCK: [2023-11-06 Mo 18:51]--[2023-11-06 Mo 19:33] =>  0:42
   CLOCK: [2023-11-06 Mo 13:14]--[2023-11-06 Mo 13:35] =>  0:21
   :END:
** Player [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** UI [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
* Bugs

